# PenGrid

## Description
Procedure PenGrid sets the snap grid distance in the document.&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE PenGrid(gridDistance : REAL (Coordinate));
```

```python

def vs.PenGrid(gridDistance):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|gridDistance|REAL (Coordinate)|Pen grid spacing.|

## Version
Availability: from MiniCAD
## Category
* Document Settings